Friends | List of all members
ACAPI::v1::APIProperty Class Reference
API Infrastructure
Class that represents a property. More...
#include <PropertyOperationManager.hpp>
 Inheritance diagram for ACAPI::v1::APIProperty:
 Friends
 class  | APIPropertyGroup
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Class that represents a property.
Since
Archicad 29